{
  "header.logo": "Valeryia Bulakhava | Product designer",
  "hero.title": "Hey, I'm Valeryia.\nI'm a Product Designer",
  "hero.text": "I find <b>the sweet pot</b> where user needs and business goals meet.",
  "hero.note": "Attention to details and good time-managmenting are the key abilities, with help me in my work and live.",
  "case.title": "Live activity for IOS & Android",
  "case.text": "Designed real-time order tracking on the lock screen for instant status updates",
  "case.project.label": "Progect",
  "case.project.name": "FIG (future is great) – delivery of goods",
  "case2.title": "American beauty group website",
  "case2.text": "<strong>Led a website redesign:</strong> updated the navigation, refined the color palette, designed the mobile version, and developed missing internal pages",
  "case2.project.label": "Progect",
  "case2.project.name": "Website for <strong>American Beauty Group</strong> – a distributor of premium sportswear and swimwear from the USA, Australia, Europe, and other countries in the CIS region",
  "case3.title": "Order management platform",
  "case3.text": "Designed a unified order management platform that empowers teams to process orders faster and with fewer errors by simplifying complex processes and creating a clear, role-based workflow",
  "case.page.title": "Live Activity for iOS & Android | Valeryia Bulakhava",
  "case.hero.title": "Live activity for IOS & Android",
  "case.hero.subtitle": "Designed real-time order tracking on the lock screen for instant status updates",
  "case.overview.title": "Overview",
  "case.overview.project": "<strong>Project:</strong> FIG (future is great) – delivery of goods",
  "case.overview.text1": "FIG is a marketplace for fast delivery of goods across Minsk, available on both iOS and Android platforms.",
  "case.overview.text2": "It's essential to design the app thoughtfully because a well-crafted interface simplifies complex processes like searching, ordering, and tracking deliveries, making them intuitive and seamless.",
  "case.overview.text3": "Good design not only improves usability but also drives conversion and long-term engagement in a competitive delivery market.",
  "case.overview.role.title": "Role and period",
  "case.overview.role.text": "Product designer (full-time)",
  "case.overview.role.period": "September 2023 - till now",
  "case.overview.company.title": "Company",
  "case.overview.company.text": "Cotvec",
  "case.overview.platforms.title": "Platforms",
  "case.overview.platforms.text": "IOS, Android",
  "case.overview.skills.title": "Applied Skills",
  "case.overview.skills.text": "Mobile app design, Material Design, Human Interface Guidelines (HIG), UX and Visual Design, Research, Usability Testing, Competitive analysis, Prototyping, Wireframing, UI Specification, Design Systems",
  "case.button.straight": "Straight to the case",
  "case.role.title": "My role on the project",
  "case.role.intro": "I leveraged Human-Centered Design principles to address complex challenges<br> by understanding business requirements, customer pain points, user journeys,<br> and feedback.",
  "case.role.flows.title": "Designed Key User Flows",
  "case.role.flows.intro": "I designed and optimized end-to-end user journeys, including:",
  "case.role.flows.item1": "<b>Live Activity</b> – designed real-time order tracking on the lock screen for instant status updates.",
  "case.role.flows.item2": "<b>Smart search with suggestions</b> – implemented AI-powered search with history, popular queries, and typo tolerance for faster discovery.",
  "case.role.flows.item3": "<b>Address management and delivery types</b> – designed a flexible address selection system tailored to different delivery options. Users can choose an address via map interaction or manual input, with the ability to save, edit, and manage multiple addresses in their profile for faster checkout.",
  "case.role.flows.item4": "<b>Discount mechanics</b> – visual integration of promotions in the catalog, product card and cart to boost conversion.",
  "case.role.flows.item5": "<b>Catalog card redesign</b> – created adaptive card layouts across categories with improved readability",
  "case.role.system.title": "Maintained the design system",
  "case.role.system.text": "Evolved and supported of the FIG design system by ensuring its consistency, scalability, and alignment with product needs.",
  "case.role.prototypes.title": "Designed interactive prototypes and led usability testing sessions",
  "case.role.prototypes.text": "to validate user flows and improve product experience",
  "case.role.specs.title": "Created UI specifications and implementation guides for developers",
  "case.role.ai.title": "AI-generated visual content",
  "case.role.ai.text": "Applied AI tools to rapidly create high-quality product category images and promotional banners.",
  "case.role.mascot.title": "Created app mascot",
  "case.role.mascot.text": "Developed and integrated a branding character to enhance emotional connection and create a friendly, approachable UX.",
  "case.cta.title": "Live Activity: Real-Time Order Tracking",
  "case.cta.text": "If you don't have time to go through the entire case, click on the button below to see the results straight away",
  "case.button.view": "View outcome",
  "case.challenge.title": "Challenge",
  "case.challenge.problem.title": "Problem",
  "case.challenge.problem.text": "Users often lose interest in their order after placing it – they don't know when it will be ready, packed, or shipped. This lack of transparency leads to support calls, negative reviews, and reduced customer loyalty.",
  "case.challenge.objective.title": "Objective",
  "case.challenge.objective.text": "Implement Live Activities that keep users informed about their order status without requiring them to open the app – even when the device is locked or the app is running in the background.",
  "case.process.title": "Design process",
  "case.process.chapter1.title": "UX research",
  "case.process.chapter1.text1": "Live Activity is a native iOS feature provided by Apple, and at the time of this feature's development, there is no official Android equivalent.",
  "case.process.chapter1.text2": "Therefore, during the research phase, I identified <strong>two main objectives:</strong>",
  "case.process.chapter1.item1": "Thoroughly <strong>examine all the nuances</strong> of how Live Activity is displayed and how it works on IOS, so that during the design process I could propose the most relevant and effective solutions, as well as account for all its specifics",
  "case.process.chapter1.item2": "Investigate <strong>how this functionality could be implemented for Android.</strong>",
  "case.process.chapter1.summary.title": "Summary",
  "case.process.chapter1.summary.text": "The knowledge gained during the research stage became the foundation for all subsequent stages.",
  "case.process.chapter2.title": "User Scenarios & States Mapping",
  "case.process.chapter2.text1": "When making a purchase, the order goes through specific statuses within the app, and all of these statuses have been implemented in Live Activities:",
  "case.process.chapter2.text2": "A unique visual element was designed for each status:",
  "case.process.chapter2.item1": "1. Icon (see Chapter 4)",
  "case.process.chapter2.item2": "2. Heading",
  "case.process.chapter2.item3": "3. Text message (e.g. \"Your order is on the way\")",
  "case.process.chapter2.item4": "4. Progress bar (helps to determine the order's status in a few seconds)",
  "case.process.chapter3.title": "Platform-Specific Design",
  "case.process.chapter3.ios.title": "IOS:",
  "case.process.chapter3.ios.item1": "<strong>1.</strong> Live Activities are available starting from iOS 16.1;",
  "case.process.chapter3.ios.item2": "<strong>2.</strong> Live Activities support four display modes: one on the Lock Screen and three in the Dynamic Island area (on iPhone 14 Pro and newer models).",
  "case.process.chapter3.ios.modes.title": "Display modes within the Dynamic Island:",
  "case.process.chapter3.ios.modes.compact": "<strong>Compact</strong> – space is allocated both to the left and right of the island.",
  "case.process.chapter3.ios.modes.minimal": "<strong>Minimal</strong> – space is allocated either only to the left or only to the right of the island. This area is quite limited and typically used for an icon, a compact representation of an interactive action, or a short text snippet.",
  "case.process.chapter3.ios.modes.expanded": "<strong>Expanded</strong> – an expanded view that appears upon a long press or tap, or triggered by an external event.",
  "case.process.chapter3.ios.text": "It was crucial to carefully design each display mode.",
  "case.process.chapter3.expanded.text": "<strong>The Expanded mode</strong> retains all elements, similar to the Live Activity on the Lock Screen, with minor adjustments aligned with Apple's Human Interface Guidelines (HIG):",
  "case.process.chapter3.expanded.item1": "Increased corner radius",
  "case.process.chapter3.expanded.item2": "Black background color",
  "case.process.chapter3.expanded.item3": "A more compact logo",
  "case.process.chapter3.compact.title": "Compact and Minimal presentation",
  "case.process.chapter3.compact.text1": "For these display modes, the goal was to ensure app recognizability and clearly indicate order progress within a very limited space.",
  "case.process.chapter3.compact.text2": "The key element is a <strong>circular progress bar</strong> – an intuitive metaphor that effectively symbolizes an ongoing process.",
  "case.process.chapter3.compact.text3": "<strong>In the Minimal presentation</strong>, the app logo is placed inside the progress bar, creating a distinctive brand identifier that clearly informs the user which app the notification came from.",
  "case.process.chapter3.compact.text4": "The final result is shown below.",
  "case.process.chapter3.android.title": "Android:",
  "case.process.chapter3.android.item1": "As mentioned earlier, Android currently does not have an official equivalent to Live Activities. However, similar functionality can be achieved using <strong>dynamic notifications.</strong>",
  "case.process.chapter3.android.item2": "<strong>Placement:</strong> The component resides in the notification panel, allowing users to access real-time information without opening the app.",
  "case.process.chapter3.android.item3": "<strong>Views:</strong> It supports both collapsed and expanded states.",
  "case.process.chapter3.android.text": "The screens can be seen below.",
  "case.process.chapter4.title": "AI Assets",
  "case.process.chapter4.text1": "Images in Live Activities play a crucial role – they help users understand the interface even without reading text.",
  "case.process.chapter4.text2": "The following criteria were established for the icons:",
  "case.process.chapter4.item1": "<strong>Instant recognizability:</strong> Users should immediately understand their order's current stage, even with a quick glance at the notification;",
  "case.process.chapter4.item2": "<strong>Consistent visual style</strong> across all icons;",
  "case.process.chapter4.item3": "<strong>Alignment with the overall app design language;</strong>",
  "case.process.chapter4.item4": "And most importantly, this process shouldn't take too much time.",
  "case.process.chapter4.conclusion.title": "Conclusion",
  "case.process.chapter4.conclusion.text": "Therefore, the best solution in this case is to use AI.",
  "case.process.chapter4.text3": "A unified color palette and visual style were defined, and after a few iterations, the icons below were created.",
  "case.process.chapter5.title": "Design System",
  "case.process.chapter5.architecture.title": "Component Architecture Considerations",
  "case.process.chapter5.architecture.text": "To avoid creating one monolithic \"Frankenstein\" component, I applied a system approach and instead of a single component, I created four smaller:",
  "case.process.chapter5.architecture.item1": "<strong>1.</strong> IOS Live Activity;",
  "case.process.chapter5.architecture.item2": "<strong>2.</strong> Android Live Activity;",
  "case.process.chapter5.architecture.item3": "<strong>3.</strong> Dynamic Island Minimal (encompassing three states: Compact, Minimal Attached, and Minimal Detached);",
  "case.process.chapter5.architecture.item4": "<strong>4.</strong> Dynamic Island Component (expanded view)",
  "case.process.chapter5.benefits.title": "What does this give us?",
  "case.process.chapter5.benefits.text": "This approach makes our system <strong>more flexible and easily scalable.</strong>",
  "case.process.chapter5.variations.text": "Live Activities are also an example of a feature that <strong>requires platform-specific component variations.</strong> While each version conveys the same core information, it operates within its own platform-specific environment and constraints.",
  "case.process.chapter5.properties.title": "The primary properties driving these components are:",
  "case.process.chapter5.properties.item1": "Delivery type (Planned, Express, Pickup);",
  "case.process.chapter5.properties.item2": "Order status.",
  "case.process.chapter5.base.text1": "It's also worth noting that each component group is built upon its own base component, which encapsulates shared logic, data structure, and core behavior – all other variants inherit from this base.",
  "case.process.chapter5.base.text2": "In turn, this base component is composed of even smaller, atomic elements (atoms).",
  "case.process.chapter5.base.text3": "Additionally, <strong>an animated prototype</strong> was developed to demonstrate transitions between states (progress changes, status updates, image swaps), and <strong>a detailed technical specification</strong> was prepared for developers.",
  "case.process.chapter6.title": "Results & Impact",
  "case.process.chapter6.technical.title": "Technical Implementation",
  "case.process.chapter6.technical.item1": "Live Activities have been successfully integrated into the app;",
  "case.process.chapter6.technical.item2": "Live Activities for Dynamic Island were implemented in full compliance with Apple's Human Interface Guidelines;",
  "case.process.chapter6.technical.item3": "For Android, a solution based on Material Design principles was identified to provide users with similar functionality;",
  "case.process.chapter6.visual.title": "Visual Consistency",
  "case.process.chapter6.visual.item1": "All elements adhere to the brand guidelines;",
  "case.process.chapter6.visual.item2": "Leveraging AI reduced the time required to create the visual assets by <strong>60%</strong>;",
  "case.process.chapter6.impact.title": "Impact:",
  "case.process.chapter6.impact.ux.title": "Enhanced UX",
  "case.process.chapter6.impact.ux.item1": "Improved usability: real-time order information is now accessible directly on the Lock Screen or in the Dynamic Island;",
  "case.process.chapter6.impact.testing.title": "Usability Testing Results",
  "case.process.chapter6.impact.testing.item1": "90% of users rated the interface as highly readable and intuitive;",
  "case.process.chapter6.impact.testing.item2": "78% of surveyed users reported that it is now easier for them to track their orders;",
  "case.process.chapter7.title": "Learnings",
  "case.process.chapter7.guidelines.title": "Deep dive into platform guidelines",
  "case.process.chapter7.guidelines.text1": "While working on Live Activities, I thoroughly studied the relevant sections of Apple's Human Interface Guidelines and Google's Material Design documentation.",
  "case.process.chapter7.guidelines.text2": "However, in this case, the guidelines became not a constraint, but a tool for crafting a high-quality user experience.",
  "footer.logo": "Valeryia Bulakhava | Product designer",
  "footer.linkedin": "Linkedin",
  "footer.email": "Email",
  "footer.behance": "Behance"
}
