{
  "header.logo": "Валерия Булохова | Продуктовый дизайнер",
  "hero.title": "Привет, я Валерия.\nЯ продуктовый дизайнер",
  "hero.text": "Нахожу <b>ту самую точку</b>, где потребности пользователей встречаются с целями бизнеса.",
  "hero.note": "Внимание к деталям и умение эффективно распоряжаться временем – ключевые качества, которые помогают мне в работе и в жизни.",
  "case.title": "Live activity для IOS & Android",
  "case.text": "Спроектировала систему отслеживания заказов в режиме реального времени на экране блокировки для мгновенного обновления статуса",
  "case.project.label": "Проект",
  "case.project.name": "FIG (future is great) – доставка товаров",
  "case2.title": "Сайт American Beauty Group",
  "case2.text": "<strong>Провела редизайн:</strong> обновила навигацию, переработала цветовую палитру, спроектировала мобильную версию и недостающие внутренние страницы сайта",
  "case2.project.label": "Проект",
  "case2.project.name": "Сайт для <strong>American Beauty Group</strong> — дистрибьютора премиальной спортивной одежды и купальников из США, Австралии, Европы и других стран региона СНГ",
  "case3.title": "Платформа управления заказами",
  "case3.text": "Спроектировала единую платформу управления заказами, которая позволяет обрабатывать заказы быстрее и с меньшим количеством ошибок за счёт упрощения сложных процессов и создания более прозрачного, понятного workflow на основе ролей",
  "case.page.title": "Live Activity для iOS & Android | Валерия Булохова",
  "case.hero.title": "Live activity для IOS & Android",
  "case.hero.subtitle": "Спроектировала систему отслеживания заказов в режиме реального времени на экране блокировки для мгновенного обновления статуса",
  "case.overview.title": "Общий обзор",
  "case.overview.project": "<strong>Проект:</strong> FIG (future is great) – доставка товаров",
  "case.overview.text1": "FIG – это маркетплейс быстрой доставки товаров по Минску, доступный на платформах iOS и Android.",
  "case.overview.text2": "Крайне важно тщательно проектировать приложение, поскольку грамотно продуманный интерфейс упрощает такие сложные процессы, как поиск, заказ и отслеживание доставки, делая их интуитивно понятными и предсказуемыми.",
  "case.overview.text3": "Хороший дизайн не только повышает удобство использования, но и способствует конверсии и долгосрочному взаимодействию на конкурентном рынке доставки.",
  "case.overview.role.title": "Роль и период",
  "case.overview.role.text": "Продуктовый дизайнер (полная занятость)",
  "case.overview.role.period": "Сентябрь 2023 – по настоящее время",
  "case.overview.company.title": "Компания",
  "case.overview.company.text": "Cotvec",
  "case.overview.platforms.title": "Платформы",
  "case.overview.platforms.text": "IOS, Android",
  "case.overview.skills.title": "Навыки",
  "case.overview.skills.text": "Проектирование мобильных приложений, Material Design, Human Interface Guidelines (HIG), UX и визуальный дизайн, исследования, тестирование удобства использования, конкурентный анализ, прототипирование, вайрфрейминг, UI спецификация, дизайн-система",
  "case.button.straight": "Перейти сразу к кейсу",
  "case.role.title": "Моя роль в проекте",
  "case.role.intro": "Решала сложные сценарии, опираясь на human-centered design и с учётом бизнес-требований, болевых точек клиентов, пользовательских путей и обратной связи.",
  "case.role.flows.title": "Проектировала ключевые пользовательские потоки",
  "case.role.flows.intro": "В процессе работы над проектом проектировала полные пользовательские сценарии, включая:",
  "case.role.flows.item1": "<b>Live Activity</b> – разработана функция отслеживания заказов в режиме реального времени на экране блокировки для мгновенного обновления статуса;",
  "case.role.flows.item2": "<b>Умный поиск с подсказками</b> – реализован поиск на базе искусственного интеллекта с учетом истории поиска, популярных запросов и допуска опечаток для более быстрого поиска;",
  "case.role.flows.item3": "<b>Управление адресами и типами доставки</b> – разработана гибкая система выбора адреса, адаптированная для различных вариантов доставки. Пользователи могут выбрать адрес с помощью карты или вручную, а также сохранять, редактировать и управлять несколькими адресами в своём профиле для более быстрого оформления заказа;",
  "case.role.flows.item4": "<b>Механика скидок</b> – визуальная интеграция акций в каталог, карточку товара и корзину для повышения конверсии;",
  "case.role.flows.item5": "<b>Редизайн карточки каталога</b> – создание адаптивных макетов карточек для разных категорий с улучшенной читаемостью;",
  "case.role.system.title": "Поддерживала и развивала дизайн-систему",
  "case.role.system.text": "Поддерживала и развивала дизайн-систему путем обеспечения ее согласованности, масштабируемости и соответствия потребностям продукта.",
  "case.role.prototypes.title": "Разрабатывала интерактивные прототипы и проводила юзабилити-тестирования",
  "case.role.prototypes.text": "для проверки пользовательских потоков и улучшения опыта использования продукта.",
  "case.role.specs.title": "Создавала спецификации пользовательского интерфейса и гайды по реализации для разработчиков.",
  "case.role.ai.title": "Генерировала графический контент с помощью ИИ",
  "case.role.ai.text": "Применяла ИИ-инструменты для быстрого создания графических материалов (категорий продуктов, рекламных баннеров и прочего).",
  "case.role.mascot.title": "Работала над маскотом приложения",
  "case.role.mascot.text": "Разработала и интегрировала маскота для усиления эмоциональной связи и создания дружественного, доступного UX.",
  "case.cta.title": "Live Activity: Отслеживание заказа в режиме реального времени",
  "case.cta.text": "Если у вас не достаточно времени на ознакомление со всем кейсом, нажмите на кнопку ниже, чтобы сразу увидеть результаты",
  "case.button.view": "Смотреть результаты",
  "case.challenge.title": "Основной челлендж",
  "case.challenge.problem.title": "Проблема",
  "case.challenge.problem.text": "Пользователи часто теряют интерес к заказу после его оформления – они не знают, когда он будет готов, собран или отправлен. Отсутствие прозрачности ведёт к звонкам в поддержку, негативным отзывам и снижению лояльности.",
  "case.challenge.objective.title": "Задача",
  "case.challenge.objective.text": "Создать живые уведомления (Live Activity), которые будут информировать пользователя о статусе заказа без необходимости открывать приложение – даже когда телефон заблокирован или в фоновом режиме.",
  "case.process.title": "Дизайн-процесс",
  "case.process.chapter1.title": "UX исследование",
  "case.process.chapter1.text1": "Live Activity – это встроенная функция iOS, предоставленная Apple, и на момент разработки этой функции официального эквивалента для Android не существовало.",
  "case.process.chapter1.text2": "Поэтому на этапе исследования мной были выделены <strong>две основные задачи:</strong>",
  "case.process.chapter1.item1": "Подробно <strong>изучить все нюансы</strong> отображения и принцип работы Live Activity на IOS, чтобы при проектировании предложить наиболее актуальные и эффективные решения, а также учесть все особенности;",
  "case.process.chapter1.item2": "Изучить <strong>каким образом можно реализовать это для андроид.</strong>",
  "case.process.chapter1.summary.title": "Ключевой вывод",
  "case.process.chapter1.summary.text": "Знания, полученные на этапе исследования, стали фундаментом для всех последующих этапов.",
  "case.process.chapter2.title": "Пользовательские сценарии и отображение состояний",
  "case.process.chapter2.text1": "При совершении покупки заказ в приложении проходит через определённые статусы, все они были перенесены на живые уведомления:",
  "case.process.chapter2.text2": "Для разных состояний был спроектирован уникальный визуальный элемент:",
  "case.process.chapter2.item1": "1. Иконка (см. Главу 4)",
  "case.process.chapter2.item2": "2. Заголовок",
  "case.process.chapter2.item3": "3. Текстовое сообщение (например, \"Ваш заказ в пути\")",
  "case.process.chapter2.item4": "4. Статус-бар (помогает за пару секунд определить на каком этапе заказ).",
  "case.process.chapter3.title": "Проектирование с учётом специфики платформ",
  "case.process.chapter3.ios.title": "IOS:",
  "case.process.chapter3.ios.item1": "<strong>1.</strong> Live Activities доступны начиная с iOS 16.1;",
  "case.process.chapter3.ios.item2": "<strong>2.</strong> У Live Activities четыре варианта отображения: один на экране блокировки и три в районе Dynamic Island (для iphone 14 pro и выше).",
  "case.process.chapter3.ios.modes.title": "Варианты отображения в районе Dynamic Island:",
  "case.process.chapter3.ios.modes.compact": "<strong>Компактное</strong>выделяется место слева и справа от островка;",
  "case.process.chapter3.ios.modes.minimal": "<strong>Минимальное</strong>выделяется часть или только справа, или только слева: пространство не очень большое, чаще всего там располагают иконку, компактную презентацию интерактивного действия или короткий текст;",
  "case.process.chapter3.ios.modes.expanded": "<strong>Расширенное</strong> – раскрытое состояние, которое отображается при длительном касании или тапе, либо по какому-то внешнему событию.",
  "case.process.chapter3.ios.text": "Важно было проработать каждое из отображений.",
  "case.process.chapter3.expanded.text": "<strong>Расширенное представление</strong> сохраняет все элементы, как и Live Activities на экране блокировки с небольшими особенностями в соответствии с HIG:",
  "case.process.chapter3.expanded.item1": "Увеличенные углы скругления ",
  "case.process.chapter3.expanded.item2": "Черный цвет фона",
  "case.process.chapter3.expanded.item3": "Более компактный лого",
  "case.process.chapter3.compact.title": "Компактное и Минимальное представление",
  "case.process.chapter3.compact.text1": "Для данных отображений цель была на небольшом пространстве обеспечить узнаваемость приложения и обозначить прогресс заказа.",
  "case.process.chapter3.compact.text2": "Главный элемент – <strong>круговой прогресс-бар.</strong> Интуитивно понятная метафора, символизирующая процесс.",
  "case.process.chapter3.compact.text3": "<strong>В Минимальном представлении</strong> во внутрь прогресс-бара помещён лого, получился своего рода бренд-идентификатор, который даёт пользователю точную информацию, от какого приложения пришло уведомление.",
  "case.process.chapter3.compact.text4": "Ниже показан итоговый результат.",
  "case.process.chapter3.android.title": "Android:",
  "case.process.chapter3.android.item1": "Как я упоминала ранее, официального эквивалента лайв активити на андроид пока что нет, но схожей функциональности можно достигнуть с помощью <strong>динамических уведомлений.</strong>",
  "case.process.chapter3.android.item2": "<strong>Расположение:</strong> компонент находится на панели уведомлений и позволяет пользователям получить доступ к информации без необходимости открывать приложение;",
  "case.process.chapter3.android.item3": "<strong>Представления:</strong> имеются свернутое и расширенное представления.",
  "case.process.chapter3.android.text": "Итоговые экраны можно увидеть ниже.",
  "case.process.chapter4.title": "AI Ассеты",
  "case.process.chapter4.text1": "Изображения в лайв активити играют важную роль – они помогают считывать интерфейс даже без текста.",
  "case.process.chapter4.text2": "Какие критерии были мной установлены для иконок:",
  "case.process.chapter4.item1": "<strong>Мгновенная узнаваемость:</strong> пользователь должен понять на каком этапе находится его заказ даже мельком взглянув на уведомление;",
  "case.process.chapter4.item2": "<strong>Единая стилистика</strong> для всех иконок;",
  "case.process.chapter4.item3": "<strong>Согласованность по стилю</strong> с приложением;",
  "case.process.chapter4.item4": "И главное, на это не должно быть потрачено много времени.",
  "case.process.chapter4.conclusion.title": "Вывод",
  "case.process.chapter4.conclusion.text": "Лучшим решением в данном случае является использование ИИ.",
  "case.process.chapter4.text3": "Была сформирована единая палитра и стилистика для иконок и спустя несколько итераций были созданы изображения ниже.",
  "case.process.chapter5.title": "Дизайн-система",
  "case.process.chapter5.architecture.title": "Особенности архитектуры компонентов",
  "case.process.chapter5.architecture.text": "Чтобы не создавать одно большое чудовище франкенштейна, использую системный подход и вместо одного компонента создаю 4 поменьше:",
  "case.process.chapter5.architecture.item1": "<strong>1.</strong> IOS Live Activity;",
  "case.process.chapter5.architecture.item2": "<strong>2.</strong> Android Live Activity;",
  "case.process.chapter5.architecture.item3": "<strong>3.</strong> Dynamic Island Minimal (включает в себя три состояния = Компактное, Минимальное прикреплённое и Минимальное обособленное);",
  "case.process.chapter5.architecture.item4": "<strong>4.</strong> Dynamic Island Component (развернутый вид).",
  "case.process.chapter5.benefits.title": "Что это дает?",
  "case.process.chapter5.benefits.text": "Этим действием мы делаем нашу систему <strong>более гибкой и легко масштабируемой.</strong>",
  "case.process.chapter5.variations.text": "Также Live Activity – это один из примеров компонентов, где есть потребность делить компоненты в зависимости от платформы. Каждый из них передаёт одинаковую информацию, но работает в своей среде (системе).",
  "case.process.chapter5.properties.title": "Основные свойства компонентов:",
  "case.process.chapter5.properties.item1": "Способ доставки (плановая, эксперсс и самовывоз);",
  "case.process.chapter5.properties.item2": "Статус заказа.",
  "case.process.chapter5.base.text1": "Отдельно стоит упомянуть, что в основе каждой группы лежит свой базовый компонент, который содержит общую логику, данные и структуру, от которого наследуются все остальные.",
  "case.process.chapter5.base.text2": "А базовый компонент в свою очередь состоит из более мелких элементов (атомов).",
  "case.process.chapter5.base.text3": "Также был подготовлен анимированный прототип для демонстрации переходов между состояниями (изменение прогресса, статуса заказа, изображения) и составлена детальная спецификация для разработчиков.",
  "case.process.chapter6.title": "Результаты и влияние",
  "case.process.chapter6.technical.title": "Техническая реализация",
  "case.process.chapter6.technical.item1": "Live Activities успешно интегрированы в приложение;",
  "case.process.chapter6.technical.item2": "Реализованы Live Activities для Динамического Острова с учётом Apple Human Interface Guidelines;",
  "case.process.chapter6.technical.item3": "Было найдено решение, базирующееся на Material Design, как обеспечить Android-пользователей подобным функционалом;",
  "case.process.chapter6.visual.title": "Визуальная согласованность:",
  "case.process.chapter6.visual.item1": "Все элементы соответствуют бренд-гайдлайнам;",
  "case.process.chapter6.visual.item2": "Использование ИИ позволило сократить время создания графический части на 60%;",
  "case.process.chapter6.impact.title": "Влияние",
  "case.process.chapter6.impact.ux.title": "Улучшение UX",
  "case.process.chapter6.impact.ux.item1": "Увеличение удобства использования: информация доступна на экране блокировки или в Динамическом острове;",
  "case.process.chapter6.impact.testing.title": "По результатам юзабилити тестирования:",
  "case.process.chapter6.impact.testing.item1": "90% пользователей отметили высокую читаемость и интуитивность интерфейса;",
  "case.process.chapter6.impact.testing.item2": "78% из опрошенных пользователей отметили, что теперь им проще следить за заказом.",
  "case.process.chapter7.title": "Ключевые выводы, уроки",
  "case.process.chapter7.guidelines.title": "Глубокое погружение в платформенные гайдлайны",
  "case.process.chapter7.guidelines.text1": "Работая над Live Activity, я глубоко изучила разделы Human Interface Guidelines (Apple) и Material Design (Google). ",
  "case.process.chapter7.guidelines.text2": "До этого я знала основные принципы, отличия и учитывала их при проектировании, но в данной задаче гайдлайны стали не ограничением, а инструментом для создания качественного ux.",
  "footer.logo": "Валерия Булохова | Продуктовый дизайнер",
  "footer.linkedin": "Linkedin",
  "footer.email": "Email",
  "footer.behance": "Behance"
}
