{
  "header.logo": "Валерия Булохова | Продуктовый дизайнер",
  "hero.title": "Привет, я Валерия.\nЯ продуктовый дизайнер",
  "hero.text": "Я <b>открытый</b> и <b>искренний</b> человек увлеченный дизайном. Внимание к деталям и умение эффективно распоряжаться временем – ключевые качества, которые помогают мне в работе и в жизни.",
  "hero.note": "(Люблю дизайн так же сильно, как и ромашковый чай)",
  "case.title": "Live activity для IOS & Android",
  "case.text": "Спроектировала систему отслеживания заказов в режиме реального времени на экране блокировки для мгновенного обновления статуса",
  "case.project.label": "Проект",
  "case.project.name": "FIG (future is great) – доставка товаров",
  "case.page.title": "Live Activity для iOS & Android | Валерия Булахава",
  "case.hero.title": "Live activity для IOS & Android",
  "case.hero.subtitle": "Спроектировала систему отслеживания заказов в режиме реального времени на экране блокировки для мгновенного обновления статуса",
  "case.overview.title": "Общий обзор",
  "case.overview.project": "<strong>Проект:</strong> FIG (future is great) – доставка товаров",
  "case.overview.text1": "FIG – это маркетплейс быстрой доставки товаров по Минску, доступный на платформах iOS и Android.",
  "case.overview.text2": "Крайне важно тщательно проектировать приложение, поскольку грамотно продуманный интерфейс упрощает такие сложные процессы, как поиск, заказ и отслеживание доставки, делая их интуитивно понятными и предсказуемыми.",
  "case.overview.text3": "Хороший дизайн не только повышает удобство использования, но и способствует конверсии и долгосрочному взаимодействию на конкурентном рынке доставки.",
  "case.overview.role.title": "Роль и период",
  "case.overview.role.text": "Продуктовый дизайнер (полная занятость)",
  "case.overview.role.period": "Сентябрь 2023 – по настоящее время",
  "case.overview.company.title": "Компания",
  "case.overview.company.text": "Cotvec",
  "case.overview.platforms.title": "Платформы",
  "case.overview.platforms.text": "IOS, Android",
  "case.overview.skills.title": "Навыки",
  "case.overview.skills.text": "Проектирование мобильных приложений, Material Design, Human Interface Guidelines (HIG), UX и визуальный дизайн, исследования, тестирование удобства использования, конкурентный анализ, прототипирование, вайрфрейминг, UI спецификация, дизайн-система",
  "case.button.straight": "Перейти сразу к кейсу",
  "case.role.title": "Моя роль в проекте",
  "case.role.intro": "Решала сложные сценарии, опираясь на human-centered design и с учётом бизнес-требований, болевых точек клиентов, пользовательских путей и обратной связи.",
  "case.role.flows.title": "Разработка ключевых пользовательских потоков",
  "case.role.flows.intro": "В процессе работы над проектом разрабатывала и проектировала полные пользовательские сценарии, включая:",
  "case.role.flows.item1": "<b>Live Activity</b> – разработала отслеживание заказа в реальном времени на экране блокировки для мгновенных обновлений статуса.",
  "case.role.flows.item2": "<b>Умный поиск с подсказками</b> – реализован поиск на базе искусственного интеллекта с учетом истории поиска, популярных запросов и допуска опечаток для более быстрого поиска.",
  "case.role.flows.item4": "<b>Механика скидок</b> – визуальная интеграция акций в каталоге, карточке товара и корзине для повышения конверсии.",
  "case.role.flows.item5": "<b>Редизайн карточки каталога</b> – создала адаптивные макеты карточек по категориям с улучшенной читаемостью",
  "case.role.system.title": "Поддержка и развитие дизайн-системы",
  "case.role.system.text": "Развивала и поддерживала дизайн-систему FIG, обеспечивая ее согласованность, масштабируемость и соответствие потребностям продукта.",
  "case.role.prototypes.title": "Разрабатывала интерактивные прототипы и проводила юзабилити-тестирования для проверки пользовательских потоков и улучшения опыта использования продукта.",
  "case.role.prototypes.text": "Создавала спецификации пользовательского интерфейса и гайды по реализации для разработчиков.",
  "case.role.specs.title": "Создала UI спецификации и руководства по реализации для разработчиков",
  "case.role.ai.title": "Визуальный контент, созданный с помощью ИИ",
  "case.role.ai.text": "Применяла инструменты ИИ для быстрого создания высококачественных изображений категорий товаров и промо-баннеров.",
  "case.role.mascot.title": "Создала маскот приложения",
  "case.role.mascot.text": "Разработала и интегрировала брендового персонажа для усиления эмоциональной связи и создания дружелюбного, доступного UX.",
  "case.cta.title": "Live Activity: отслеживание заказа в реальном времени",
  "case.cta.text": "Если у вас нет времени просматривать весь кейс, нажмите на кнопку ниже, чтобы сразу увидеть результаты",
  "case.button.view": "Посмотреть результат",
  "case.challenge.title": "Задача",
  "case.challenge.problem.title": "Проблема",
  "case.challenge.problem.text": "Пользователи часто теряют интерес к своему заказу после его оформления – они не знают, когда он будет готов, упакован или отправлен. Эта непрозрачность приводит к обращениям в поддержку, негативным отзывам и снижению лояльности клиентов.",
  "case.challenge.objective.title": "Цель",
  "case.challenge.objective.text": "Реализовать Live Activities, которые информируют пользователей о статусе их заказа без необходимости открывать приложение – даже когда устройство заблокировано или приложение работает в фоновом режиме.",
  "case.process.title": "Процесс дизайна",
  "case.process.chapter1.title": "UX исследование",
  "case.process.chapter1.text1": "Live Activity – это нативная функция iOS от Apple, и на момент разработки этой функции официального аналога для Android не существует.",
  "case.process.chapter1.text2": "Поэтому на этапе исследования я определила <strong>две основные цели:</strong>",
  "case.process.chapter1.item1": "Тщательно <strong>изучить все нюансы</strong> того, как Live Activity отображается и работает на IOS, чтобы в процессе дизайна я могла предложить наиболее релевантные и эффективные решения, а также учесть все его особенности",
  "case.process.chapter1.item2": "Исследовать <strong>как эта функциональность может быть реализована для Android.</strong>",
  "case.process.chapter1.summary.title": "Резюме",
  "case.process.chapter1.summary.text": "Знания, полученные на этапе исследования, стали основой для всех последующих этапов.",
  "case.process.chapter2.title": "Пользовательские сценарии и маппинг состояний",
  "case.process.chapter2.text1": "При совершении покупки заказ проходит через определенные статусы в приложении, и все эти статусы были реализованы в Live Activities:",
  "case.process.chapter2.text2": "Для каждого статуса был разработан уникальный визуальный элемент:",
  "case.process.chapter2.item1": "1. Иконка (см. Главу 4)",
  "case.process.chapter2.item2": "2. Заголовок",
  "case.process.chapter2.item3": "3. Текстовое сообщение (например, \"Ваш заказ в пути\")",
  "case.process.chapter2.item4": "4. Индикатор прогресса (помогает определить статус заказа за несколько секунд)",
  "case.process.chapter3.title": "Платформо-специфичный дизайн",
  "case.process.chapter3.ios.title": "IOS:",
  "case.process.chapter3.ios.item1": "<strong>1.</strong> Live Activities доступны начиная с iOS 16.1;",
  "case.process.chapter3.ios.item2": "<strong>2.</strong> Live Activities поддерживают четыре режима отображения: один на экране блокировки и три в области Dynamic Island (на iPhone 14 Pro и более новых моделях).",
  "case.process.chapter3.ios.modes.title": "Режимы отображения в Dynamic Island:",
  "case.process.chapter3.ios.modes.compact": "<strong>Компактный</strong> – пространство выделяется как слева, так и справа от островка.",
  "case.process.chapter3.ios.modes.minimal": "<strong>Минимальный</strong> – пространство выделяется либо только слева, либо только справа от островка. Эта область довольно ограничена и обычно используется для иконки, компактного представления интерактивного действия или короткого текстового фрагмента.",
  "case.process.chapter3.ios.modes.expanded": "<strong>Развернутый</strong> – развернутый вид, который появляется при длительном нажатии или касании, или запускается внешним событием.",
  "case.process.chapter3.ios.text": "Было важно тщательно продумать каждый режим отображения.",
  "case.process.chapter3.expanded.text": "<strong>Развернутый режим</strong> сохраняет все элементы, аналогично Live Activity на экране блокировки, с небольшими корректировками в соответствии с Human Interface Guidelines (HIG) от Apple:",
  "case.process.chapter3.expanded.item1": "Увеличенный радиус скругления",
  "case.process.chapter3.expanded.item2": "Черный цвет фона",
  "case.process.chapter3.expanded.item3": "Более компактный логотип",
  "case.process.chapter3.compact.title": "Компактное и минимальное представление",
  "case.process.chapter3.compact.text1": "Для этих режимов отображения целью было обеспечить узнаваемость приложения и четко указать прогресс заказа в очень ограниченном пространстве.",
  "case.process.chapter3.compact.text2": "Ключевой элемент – это <strong>круговой индикатор прогресса</strong> – интуитивная метафора, которая эффективно символизирует текущий процесс.",
  "case.process.chapter3.compact.text3": "<strong>В минимальном представлении</strong> логотип приложения размещается внутри индикатора прогресса, создавая отличительный брендовый идентификатор, который четко информирует пользователя, из какого приложения пришло уведомление.",
  "case.process.chapter3.compact.text4": "Финальный результат показан ниже.",
  "case.process.chapter3.android.title": "Android:",
  "case.process.chapter3.android.item1": "Как упоминалось ранее, Android в настоящее время не имеет официального аналога Live Activities. Однако аналогичную функциональность можно достичь с помощью <strong>динамических уведомлений.</strong>",
  "case.process.chapter3.android.item2": "<strong>Размещение:</strong> Компонент находится в панели уведомлений, позволяя пользователям получать доступ к информации в реальном времени без открытия приложения.",
  "case.process.chapter3.android.item3": "<strong>Виды:</strong> Поддерживает как свернутое, так и развернутое состояние.",
  "case.process.chapter3.android.text": "Экраны можно увидеть ниже.",
  "case.process.chapter4.title": "Ассеты, созданные с помощью ИИ",
  "case.process.chapter4.text1": "Изображения в Live Activities играют решающую роль – они помогают пользователям понять интерфейс даже без чтения текста.",
  "case.process.chapter4.text2": "Для иконок были установлены следующие критерии:",
  "case.process.chapter4.item1": "<strong>Мгновенная узнаваемость:</strong> Пользователи должны сразу понимать текущий этап своего заказа, даже при беглом взгляде на уведомление;",
  "case.process.chapter4.item2": "<strong>Единый визуальный стиль</strong> для всех иконок;",
  "case.process.chapter4.item3": "<strong>Соответствие общему языку дизайна приложения;</strong>",
  "case.process.chapter4.item4": "И самое главное, этот процесс не должен занимать слишком много времени.",
  "case.process.chapter4.conclusion.title": "Вывод",
  "case.process.chapter4.conclusion.text": "Поэтому лучшее решение в данном случае – использовать ИИ.",
  "case.process.chapter4.text3": "Была определена единая цветовая палитра и визуальный стиль, и после нескольких итераций были созданы иконки ниже.",
  "case.process.chapter5.title": "Дизайн-система",
  "case.process.chapter5.architecture.title": "Соображения по архитектуре компонентов",
  "case.process.chapter5.architecture.text": "Чтобы избежать создания одного монолитного \"Франкенштейна\" компонента, я применила системный подход и вместо одного компонента создала четыре меньших:",
  "case.process.chapter5.architecture.item1": "<strong>1.</strong> IOS Live Activity;",
  "case.process.chapter5.architecture.item2": "<strong>2.</strong> Android Live Activity;",
  "case.process.chapter5.architecture.item3": "<strong>3.</strong> Dynamic Island Minimal (включая три состояния: Compact, Minimal Attached и Minimal Detached);",
  "case.process.chapter5.architecture.item4": "<strong>4.</strong> Dynamic Island Component (развернутый вид)",
  "case.process.chapter5.benefits.title": "Что это нам дает?",
  "case.process.chapter5.benefits.text": "Такой подход делает нашу систему <strong>более гибкой и легко масштабируемой.</strong>",
  "case.process.chapter5.variations.text": "Live Activities также являются примером функции, которая <strong>требует платформо-специфичных вариаций компонентов.</strong> Хотя каждая версия передает одну и ту же основную информацию, она работает в своей собственной платформо-специфичной среде и ограничениях.",
  "case.process.chapter5.properties.title": "Основные свойства, управляющие этими компонентами:",
  "case.process.chapter5.properties.item1": "Тип доставки (Плановая, Экспресс, Самовывоз);",
  "case.process.chapter5.properties.item2": "Статус заказа.",
  "case.process.chapter5.base.text1": "Также стоит отметить, что каждая группа компонентов построена на своем базовом компоненте, который инкапсулирует общую логику, структуру данных и основное поведение – все остальные варианты наследуются от этой базы.",
  "case.process.chapter5.base.text2": "В свою очередь, этот базовый компонент состоит из еще более мелких, атомарных элементов (атомов).",
  "case.process.chapter5.base.text3": "Кроме того, был разработан <strong>анимированный прототип</strong> для демонстрации переходов между состояниями (изменения прогресса, обновления статуса, замена изображений), и была подготовлена <strong>подробная техническая спецификация</strong> для разработчиков.",
  "case.process.chapter6.title": "Результаты и влияние",
  "case.process.chapter6.technical.title": "Техническая реализация",
  "case.process.chapter6.technical.item1": "Live Activities были успешно интегрированы в приложение;",
  "case.process.chapter6.technical.item2": "Live Activities для Dynamic Island были реализованы в полном соответствии с Human Interface Guidelines от Apple;",
  "case.process.chapter6.technical.item3": "Для Android было найдено решение на основе принципов Material Design для предоставления пользователям аналогичной функциональности;",
  "case.process.chapter6.visual.title": "Визуальная согласованность",
  "case.process.chapter6.visual.item1": "Все элементы соответствуют бренд-гайдлайнам;",
  "case.process.chapter6.visual.item2": "Использование ИИ сократило время, необходимое для создания визуальных ассетов, на <strong>60%</strong>;",
  "case.process.chapter6.impact.title": "Влияние:",
  "case.process.chapter6.impact.ux.title": "Улучшенный UX",
  "case.process.chapter6.impact.ux.item1": "Улучшенная удобность использования: информация о заказе в реальном времени теперь доступна непосредственно на экране блокировки или в Dynamic Island;",
  "case.process.chapter6.impact.testing.title": "Результаты юзабилити-тестирования",
  "case.process.chapter6.impact.testing.item1": "90% пользователей оценили интерфейс как очень читаемый и интуитивный;",
  "case.process.chapter6.impact.testing.item2": "78% опрошенных пользователей сообщили, что им теперь легче отслеживать свои заказы;",
  "case.process.chapter7.title": "Выводы",
  "case.process.chapter7.guidelines.title": "Глубокое погружение в гайдлайны платформ",
  "case.process.chapter7.guidelines.text1": "Работая над Live Activities, я тщательно изучила соответствующие разделы Human Interface Guidelines от Apple и документации Material Design от Google.",
  "case.process.chapter7.guidelines.text2": "Однако в данном случае гайдлайны стали не ограничением, а инструментом для создания качественного пользовательского опыта.",
  "footer.logo": "Валерия Булахава | Продуктовый дизайнер",
  "footer.linkedin": "Linkedin",
  "footer.email": "Email",
  "footer.behance": "Behance"
}
